       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPLCPY.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY ACCTTMPL REPLACING ==:PREFIX:== BY WS-CUST.
       01 WS-STATUS                 PIC X VALUE "A".

       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           DISPLAY WS-CUST-NAME.
           STOP RUN.
