IDENTIFICATION DIVISION.
PROGRAM-ID. CICSFLOW.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(20) VALUE "READY TO SEND".
01 WS-RESP PIC 9(4) COMP.

PROCEDURE DIVISION.
MAIN-PROGRAM.
    PERFORM INIT-ROUTINE THRU FINISH-ROUTINE
    EXEC CICS SEND TEXT FROM(WS-MESSAGE) RESP(WS-RESP) END-EXEC
    GOBACK.

INIT-ROUTINE.
    DISPLAY "INIT".

PROCESS-ROUTINE.
    DISPLAY WS-MESSAGE.

FINISH-ROUTINE.
    DISPLAY "DONE".
